week06/day02/BookApp/app/views/genres/show.html.erb

SELECT "books".* FROM "books" INNER JOIN "books_genres" ON "books"."id" = "books_genres"."book_id" WHERE "books_genres"."genre_id" = ?  [["genre_id", 23]]
---
<ul>
<% @genre.books.each do |book| %>