week06/day02/BookApp/app/views/authors/show.html.erb


<h3>This author has written <%= pluralize @author.books.length, "book" %> :</h3>
---
SELECT "books".* FROM "books" WHERE "books"."author_id" = ?  [["author_id", 10]]

<ul>
  <% @author.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."author_id" = ?  [["author_id", 10]]

<ul>
  <% @author.genres.uniq.each do |genre| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "books_genres" ON "genres"."id" = "books_genres"."genre_id" INNER JOIN "books" ON "books_genres"."book_id" = "books"."id" WHERE "books"."author_id" = ?  [["author_id", 10]]