week06/day02/BookApp/app/controllers/books_controller.rb

  def create
    book = Book.create book_params
---
INSERT INTO "books" ("title", "blurb", "image", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Sultan the developer"], ["blurb", "no desc"], ["image", ""], ["author_id", 10], ["created_at", "2018-11-05 10:32:24.437975"], ["updated_at", "2018-11-05 10:32:24.437975"]]