week06/day02/MyBlog/app/controllers/posts_controller.rb

  def update
    post = Post.find_by(id: params[:id])
    post.update post_params
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "test0   1 1"], ["updated_at", "2018-11-06 08:27:22.565066"], ["id", 2]]

  def create
    # post = Post.create(post_params)
    current_user.posts.create(post_params)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "cu1"], ["body", "cu1"], ["created_at", "2018-11-06 08:44:27.517997"], ["updated_at", "2018-11-06 08:44:27.517997"], ["user_id", 1]]