week06/day02/BookApp/app/views/books/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <%= f.label :author_id, "Who wrote this book?" %>
    <%= f.collection_select :author_id, Author.all, :id, :name %>

SELECT "genres".* FROM "genres"
---
    <%= f.label :genre_ids, "What genre is this book?" %>
    <%= f.collection_check_boxes :genre_ids, Genre.all, :id, :name %>