week06/day02/BookApp/app/views/books/show.html.erb


<% @book.genres.each do |gen| %>
---
SELECT "genres".* FROM "genres" INNER JOIN "books_genres" ON "genres"."id" = "books_genres"."genre_id" WHERE "books_genres"."book_id" = ?  [["book_id", 17]]