week08/day02/TodoApp/app/controllers/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def show
    @todo = Todo.find_by(id: params[:id])

INSERT INTO "todos" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "test"], ["created_at", "2018-11-20 07:36:37.681258"], ["updated_at", "2018-11-20 07:36:37.681258"]]
---
   def create
    todo =Todo.create(todoParams)