week05/day02/Dounts/app/controllers/donuts_controller.rb

SELECT "donuts".* FROM "donuts"
---
  def index
    @donuts = Donut.all

SELECT  "donuts".* FROM "donuts" WHERE "donuts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @donut = Donut.find(params[:id])

SELECT  "donuts".* FROM "donuts" WHERE "donuts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @donut = Donut.find(params[:id])

INSERT INTO "donuts" ("name", "size", "frosting_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "aaa"], ["size", "ssss"], ["frosting_type", "dddd"], ["created_at", "2018-10-29 12:30:08.983584"], ["updated_at", "2018-10-29 12:30:08.983584"]]
---
  def create
    # binding.pry
    donut_params = params.require(:donut).permit(:name, :size, :frosting_type)
    @donut = Donut.create(donut_params)

SELECT  "donuts".* FROM "donuts" WHERE "donuts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "donuts" SET "name" = ?, "size" = ?, "frosting_type" = ?, "updated_at" = ? WHERE "donuts"."id" = ?  [["name", "aaabbw"], ["size", "ssssbbw"], ["frosting_type", "ddddbbw"], ["updated_at", "2018-10-29 12:45:57.453490"], ["id", 1]]
---
  def update
 donut_params = params.require(:donut).permit(:name, :size, :frosting_type)
    @donut = Donut.find(params[:id])
    @donut.update(donut_params)