week06/day01/BookApp_old/app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    # raise "An error"
    @author = Author.find_by(id: params[:id])

INSERT INTO "authors" ("name", "dob", "location", "image", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    author = Author.create(author_params)

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "authors" SET "name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["name", "sultan3"], ["updated_at", "2018-11-04 10:35:06.785442"], ["id", 4]]
---
  def update
    @author = Author.find(params[:id])

    @author.update(author_params)

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 3]]
---
  def destroy
author = Author.find_by(id: params[:id])
author.destroy