week06/day01/BookApp_old/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "image", "blurb", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "book2"], ["image", ""], ["blurb", "book2 title"], ["author_id", 5], ["created_at", "2018-11-04 13:20:18.055756"], ["updated_at", "2018-11-04 13:20:18.055756"]]
---
  def create
    book = Book.create book_params

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @book = Book.find_by(id: params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "blurb" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "book3"], ["blurb", "book3 title"], ["updated_at", "2018-11-04 13:21:19.877310"], ["id", 4]]
---
  def update
    @book = Book.find_by(id: params[:id])
    @book.update(book_params)