week06/day01/BookApp_old/app/views/books/_form.html.erb

<%= f.label :author_id, "who is the author?"%>
<%= f.collection_select :author_id, Author.all, :id, :name %>
---
SELECT "authors".* FROM "authors"