week06/day01/BookApp_old/app/views/authors/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."author_id" = ?  [["author_id", 6]]
---
<ul>
 <% @author.Books.each do |book|%>